---
type: InternalOrigin
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# InternalOrigin

`Autodesk.Revit.DB.InternalOrigin` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Get | 2020.2 | `public static InternalOrigin Get ( Document document )` |
| Property | Parameter | — | `` |
| Property | Position | 2020.2 | `public XYZ Position { get ; }` |
| Property | SharedPosition | 2020.2 | `public XYZ SharedPosition { get ; }` |